import json
from tqdm import tqdm
f1 = open("data/CNewSum_v2/diverse/train.source", "w", encoding="utf-8")
f2 = open("data/CNewSum_v2/diverse/train.target", "w", encoding="utf-8")
with open("data/CNewSum_v2/diverse/final/train.simple.label.jsonl", "r") as f:
    lines = f.readlines()
    for line in tqdm(lines):
        data = json.loads(line)
        # {"article": ["福建 男子 郑某 因 “ 醉酒 ” 驾驶 机动车 被 福建 福州市 仓山区 交警 大队 查获 , 法院 判处 郑某 拘役 一个 月 缓刑 两个月 , 并处 吊销 机动车 驾驶证 。", "在 执行 缓刑 的 期间 , 4月 10 日 , 该 男子 再次 伪造 驾驶证 上路 行驶 , 被 高警 利川 大队 在 沪 渝 高速公路 白羊塘 省际 卡口 查获 。", "郑某 因涉嫌 实施 了 使用 伪造 的 机动车 驾驶证 、 驾驶证 吊销 期间 驾驶 机动车 的 两项 违法行为 , 被 大队 依法 处以 罚款 5500 元 、 拘留 7日 的 行政处罚 。", "福建 福州市 仓山区 司法 部门 将 对 郑某 进行 “ 二次 收监 。", "4月 10 日 10 时 许 , 高警 利川 大队 秩序 管理 二中队 民警 在 白羊塘 服务区 执勤 时 , 在 对 一辆 牌号 为 闽 ADK 862 的 小型 轿车 例行 检查 时 , 民警 要求 驾驶员 郑某 出示 驾驶证 接受 检查 , 民警 拿到 驾驶证 一看 , 很 明显 看出 是 一本 伪造 的 驾驶证 , 于是 对 郑某 所持 有的 驾驶证 情况 进行 了 询问 , 郑某 称 自己 的 驾驶证 没有 问题 , 百般 抵赖 。", "为 防止 驾驶员 郑某 逃跑 , 民警 要求 驾驶员 下车 到 岗亭 接受 处罚 , 民警 通过 公安网 查询 郑某 驾驶证 已 被 吊销 , 且 伪造 的 驾驶证 证 芯 编号 与 网上 登记 的 证 芯 编号 不一致 。", "民警 向 郑某 出示 了 相关 证据 , 在 铁证 面前 , 驾驶员 郑某 不得不 坦白 自己 的 违法 事实 , 2015年 12月 , 郑某 在 福州 因 醉酒驾驶 被 当地 公安机关 刑事拘留 , 法院 判处 郑某 拘役 一个 月 , 缓刑 两个月 监外 执行 。", "拘役 期满 后 , 郑某 觉得 驾驶证 被 吊销 后 出门 十分 不便 , 后来 就 在 外面 找 人 办理 了 一本 假的 机动车 驾驶证 。", "随后 , 民警 与 福州 车管所 取得 联系 , 查实 郑某 2015年 12月 因 醉酒驾驶 被 福州 公安机关 处理 , 驾驶证 被 吊销 , 并且 现在 还 在 缓刑 期间 。", "最后 , 郑某 因涉嫌 实施 了 使用 伪造 的 机动车 驾驶证 、 驾驶证 被 吊销 的 人 驾驶 机动车 的 两项 违法行为 , 被 依法 处以 罚款 5500 元 、 拘留 7日 的 行政处罚 。", "高警 利川 大队 将 这 一 情况 反馈 给 福州 仓山区 司法 部门 , 司法 部门 对于 郑某 违反 监外 执行 缓刑 的 规定 , 将 对 其 进行 “ 二次 收监 。"], "summary": "男子 醉驾 缓刑 期内 再次 伪造 驾驶证 , 上路 行驶 被 警方 查处 。", "id": 307364, "label": [1]}
        text = "".join(["".join(i.split()) for i in data["article"]]).replace("\n", "").replace("\r", "")
        summary = "".join(data["summary"].split())
        f1.write(text + "\n")
        f2.write(summary + "\n")
    
    f1.flush()
    f2.flush()
    
